import pandas as pd
import pytest


@pytest.fixture
def df_for_tests():
    return pd.DataFrame(
        {
            "Дата операции": [
                "31.12.2021 16:44:00",
                "31.12.2021 15:44:39",
                "30.12.2021 19:06:39",
                "31.12.2021 01:23:42",
                "30.12.2021 17:50:30",
            ],
            "Номер карты": ["*7197", "*7197", "*7197", "*5091", "*4556"],
            "Категория": ["Супермаркеты", "Супермаркеты", "Каршеринг", "Различные товары", "Пополнения"],
            "Сумма платежа": [-160.89, -78.05, -1.32, -564.00, 5046.00],
            "Описание": ["Колхоз", "Колхоз", "Ситидрайв", "Ozon.ru", "Пополнение через Газпромбанк"],
        }
    )


@pytest.fixture
def df_with_datetime_for_tests():
    test_df = pd.DataFrame(
        {
            "Дата операции": [
                "31.12.2021 16:44:00",
                "31.12.2021 15:44:39",
                "30.12.2021 19:06:39",
                "31.12.2021 01:23:42",
                "30.12.2021 17:50:30",
            ],
            "Номер карты": ["*7197", "*7197", "*7197", "*5091", "*4556"],
            "Категория": ["Супермаркеты", "Супермаркеты", "Каршеринг", "Различные товары", "Пополнения"],
            "Сумма платежа": [-160.89, -78.05, -1.32, -564.00, 5046.00],
            "Описание": ["Колхоз", "Колхоз", "Ситидрайв", "Ozon.ru", "Пополнение через Газпромбанк"],
        }
    )
    test_df["Дата операции"] = pd.to_datetime(test_df["Дата операции"], format="mixed", dayfirst=True)

    return test_df


@pytest.fixture
def list_of_dict():
    return df_for_tests.to_dict
